#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

시스템  크래프터가 사용하는 폰트 사이즈가 나한테 마ㅈ지 않은 수도 있으니,
추후에 수정할 수도 있다고 생각하자.
#+begin_src emacs-lisp

  (defvar efs/default-font-size 120)
  (defvar efs/default-variable-font-size 120)
  
#+end_src

*** Nicer Heading Bullets

org-bullets https://github.com/sabof/org-bullets
오그 불릿, 별 하나, 별 둘, 모양을 바꾼다.

#+begin_src emacs-lisp

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

#+RESULTS:
| org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |

** Configure Babel Languages

Org Mode 내부 코드 블록을 실행하거나 이용하려면, language 설정을 해야한다.
https://orgmode.org/worg/org-contrib/babel/langues.html
language 리스트를 볼 수 있다.

#+begin_src emacs-lisp

  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

